//DP를 푸는 과정
//1. 테이블 정의하기
//2. 점화식 찾기
//3. 초기값 정하기
//코딩테스트에 나올 수준의 DP는 일단 점화식만 찾고나면
//그 뒤는 초기값을 채워넣은 후 반복문을 돌며 배열을 채우면 된다

//boj1463 1로 만들기
//boj9095 1,2,3 더하기
//boj2579 계단오르기
//boj1149 RGB거리
//boj11726 2*n 타일링
//boj11659 구간 합 구하기 4
//boj12852 1로 만들기 2
//boj1932 정수 삼각형
//boj2193 이친수
//boj11727 2*N 타일링 2
//boj14501 퇴사
//boj18353 병사배치하기
//LIS(Longest Increasing Subsequence)
//하나의 수열이 주어졌을 때 값들이 증가하는 형태의 가장 긴 부분 수열을 찾는 대표적인 dp
//boj11053 가장 긴 증가하는 부분 수열(LCS)
//boj11055 가장 큰 증가 부분 수열
//boj11722 가장 긴 감소하는 부분 수열
//boj2156 포도주 시식(boj 2579와 비슷)
//(하다고 생각했지만 큰 착각이었음)
//boj2294 동전 2
//boj1912 연속합
//boj9461 파도반 수열
//boj10844 쉬운 계단 수
//boj1699 제곱수의 합
//boj2133 타일 채우기
//boj9465 스티커
//boj1904 01타일
//boj9252 LCS
//boj9252 LCS 2
//boj1788 피보나치 수의 확장